malliv/viikko4/app/controllers/beers_controller.rb

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", Thu, 16 Jan 2014 13:15:13 UTC +00:00], ["name", "Lappari"], ["style", "lager"], ["updated_at", Thu, 16 Jan 2014 13:15:13 UTC +00:00]]

  def update
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "name" = ?, "updated_at" = ? WHERE "beers"."id" = 6  [["name", "Hefeweizen"], ["updated_at", Thu, 30 Jan 2014 18:16:45 UTC +00:00]]

    def set_breweries_and_styles_for_template
      @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"