malliv/viikko5/app/controllers/beers_controller.rb

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 6], ["created_at", Wed, 05 Feb 2014 18:46:14 UTC +00:00], ["name", "Sierra Nevada Pale Ale"], ["style_id", 2], ["updated_at", Wed, 05 Feb 2014 18:46:14 UTC +00:00]]

  def update
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "name" = ?, "updated_at" = ? WHERE "beers"."id" = 6  [["name", "Hefeweizen"], ["updated_at", Thu, 30 Jan 2014 18:16:45 UTC +00:00]]