malliv/viikko5/app/controllers/beer_clubs_controller.rb

  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("city", "created_at", "founded", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Helsinki"], ["created_at", Thu, 23 Jan 2014 00:02:58 UTC +00:00], ["founded", 1989], ["name", "Vallilan hiiva"], ["updated_at", Thu, 23 Jan 2014 00:02:58 UTC +00:00]]