malliv/viikko2/app/controllers/beers_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def new
    @beer = Beer.new
    @breweries = Brewery.all

INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", Thu, 16 Jan 2014 13:15:13 UTC +00:00], ["name", "Lappari"], ["style", "lager"], ["updated_at", Thu, 16 Jan 2014 13:15:13 UTC +00:00]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save