malliv/viikko2/app/controllers/breweries_controller.rb

UPDATE "breweries" SET "name" = ?, "updated_at" = ? WHERE "breweries"."id" = 4  [["name", "BrewDog"], ["updated_at", Thu, 16 Jan 2014 19:41:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @brewery.update(brewery_params)